{"@attributes":{"version":"2.0"},"channel":{"title":"Tracks - Pitchfork","link":"http:\/\/pitchfork.com\/reviews\/tracks\/","description":"The latest and greatest mp3s, album streams, and mixtapes.","language":"en-us","lastBuildDate":"Mon, 10 Nov 2014 17:00:00 -0500","ttl":"300","item":[{"title":"Silk Rhodes: \"Realtime\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17210-silk-rhodes-realtime\/","description":"\n<p>From how their name references the shady, defunct Deep Web drug market, it's fairly evident that Sasha Winn and Michael Collins (the duo behind <a href=\"https:\/\/soundcloud.com\/silkrhodes\" target=\"_blank\" rel=\"nofollow\">Silk Rhodes<\/a>) have a pretty intense interest in psychedelia. Both members cut their teeth in more explicitly acid-addled affairs, with Winn functioning as an occasional live member of Collins' goofily punning psych-pop projects <a href=\"http:\/\/pitchfork.com\/artists\/29966-run-dmt\/\" target=\"_blank\">Run DMT<\/a> and <a href=\"http:\/\/pitchfork.com\/artists\/31487-salvia-plath\/\" target=\"_blank\">Salvia Plath<\/a>. Now they're pushing their paisley pop music into realms more fitting of their new home on <a href=\"http:\/\/www.stonesthrow.com\" target=\"_blank\" rel=\"nofollow\">Stones Throw<\/a>.<!--pagebreak--><\/p> <p>On \"Realtime\", Winn's glazed vocals jump to the forefront of a stripped down instrumental that wouldn't sound out of place on the dusty soul records that <a href=\"http:\/\/www.numerogroup.com\" target=\"_blank\" rel=\"nofollow\">Numero Group<\/a> reissues year after year. Dreary keyboard lines and a gently clattering rhythm section suggest a more simple and straightforward direction for the duo, but as the track goes on Winn layers more and more multitracked harmonies—lending the song a kaleidoscopic quality. With Silk Rhodes, Winn and Collins are moving away from the outward signifiers of psychedelia, but even as they dip their toes into new realms, they still retain their uniquely warped worldview.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F175195093&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Mon, 10 Nov 2014 17:00:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17210-silk-rhodes-realtime\/"},{"title":"Migos: \"Hit Em\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17209-migos-hit-em\/","description":"\n<p>Every rapper with a pulse and a SoundCloud tried the <a href=\"http:\/\/pitchfork.com\/artists\/31455-migos\/\" target=\"_blank\">Migos<\/a> triplet flow after last summer's <a href=\"http:\/\/pitchfork.com\/reviews\/albums\/18264-migos-yrn-young-rich-niggas\/\" target=\"_blank\"><i>YRN<\/i><\/a> tipped the Atlanta trio into the national consciousness. The group, in turn, spent an unfortunate chunk of follow up <i>No Label II<\/i> reminding us that the offending parties were old and out-of-touch. They've since lightened up, and the just released <a href=\"http:\/\/www.livemixtapes.com\/mixtapes\/30538\/migos-rich-nigga-timeline.html\" target=\"_blank\" rel=\"nofollow\"><i>Rich Nigga Timeline<\/i><\/a> seems content with letting the flamboyance of its craft state the case. Early highlight \"Hit Em\" spread's the pugilistic theme of <i>No Label II<\/i> single \"Fight Night\" around a bit. It's never clear what the chorus' manic \"Hit em wit it\" is imploring us to hit—eggbeaters? gunshots? backshots?—but a mix of perfectly cockamamie punchlines and real triumph over adversity pulls the spotlight off a foggy concept.<!--pagebreak--><\/p> <p><a href=\"https:\/\/twitter.com\/offsetyrn\" target=\"_blank\" rel=\"nofollow\">Offset<\/a> steals the show with a quick designer spot check and a Farnsworth Bentley joke midway through: \"I am not a mason but I'm rocking Margiellas\/ Higher than a motherfucker, just like a propeller\/ Riding in the Mulsanne, Bentley got umbrellas.\" But <a href=\"https:\/\/twitter.com\/1YoungTakeoff\" target=\"_blank\" rel=\"nofollow\">Takeoff<\/a>'s verse three account of the group <a href=\"http:\/\/pitchfork.com\/news\/54553-migos-involved-in-miami-shootout\/\" target=\"_blank\">surviving a highway drive-by back in March<\/a> is a sobering rejoinder. You get the sense that the Migos' gutbusting snaps are a coping mechanism, a bit of \"Tom and Jerry\" to break up the <i>Snow on tha Bluff<\/i>.<\/p> <p> <object classid=\"clsid:D27CDB6E-AE6D-11cf-96B8-444553540000\" width=\"300\" height=\"24\" id=\"player-11172\" name=\"player1\"> <param name=\"movie\" value=\"http:\/\/cdn.pitchfork.com\/streaming-player\/player.swf\"> <param name=\"allowfullscreen\" value=\"false\"> <param name=\"allowscriptaccess\" value=\"always\"> <param name=\"flashvars\" value=\"file=Migos_-_22Hit_Em22.mp3&title=&quot;Hit Em&quot;&lightcolor=EF4135&streamer=rtmp:\/\/s3w1mu85xbnhjc.cloudfront.net\/cfx\/st\"> <embed id=\"player-11172\" name=\"player-11172\" src=\"http:\/\/cdn.pitchfork.com\/streaming-player\/player.swf\" width=\"300\" height=\"24\" allowscriptaccess=\"always\" allowfullscreen=\"false\" flashvars=\"file=Migos_-_22Hit_Em22.mp3&title=&quot;Hit Em&quot;&lightcolor=EF4135&streamer=rtmp:\/\/s3w1mu85xbnhjc.cloudfront.net\/cfx\/st\" \/>\n<\/object>\n<\/p>\n","pubDate":"Mon, 10 Nov 2014 15:30:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17209-migos-hit-em\/"},{"title":"Big Ups: \"Rash\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17208-big-ups-rash\/","description":"\n<p>Joe Galarraga's politics are a known quantity since February's <a href=\"http:\/\/pitchfork.com\/reviews\/albums\/18887-big-ups-eighteen-hours-of-static\/\" target=\"_blank\"><i>Eighteen Hours of Static<\/i><\/a>; delivered one simplistic, throat-searing couplet at a time, <a href=\"http:\/\/pitchfork.com\/artists\/31600-big-ups\/\" target=\"_blank\">Big Ups<\/a> have rejected the abstractions Ian Mackaye sought in Fugazi. But Big Ups' platform runs not on policy but attitude, and \"Rash\", taken from an <a href=\"https:\/\/soundcloud.com\/wearebigups\/rash\" target=\"_blank\" rel=\"nofollow\">upcoming split with Washer<\/a>, is itchin' with it. Every thrashing bar is a spirited attack on a city too packed not to burst, frenzied with the anxiety of being kettled on all sides. \"We're always surrounded by people on the street and the transit system,\" Galarraga <a href=\"https:\/\/soundcloud.com\/wearebigups\/rash\" target=\"_blank\" rel=\"nofollow\">says of the song<\/a>,&#160;\"On bad days, this can be all too overwhelming.\" That frustration manifests as a sub-two minute outburst of aggression, lashing out in an attempt to clear some room. That Galarraga implicates himself as a rash as well speaks to just how inescapable the situation is.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F161580111&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Fri, 07 Nov 2014 14:30:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17208-big-ups-rash\/"},{"title":"The Amazing: \"Picture You\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17200-the-amazing-picture-you\/","description":"\n<p>For a band with such a self-aggrandizing name, Swedish psych-pop outfit <a href=\"http:\/\/pitchfork.com\/artists\/28372-the-amazing\/\" target=\"_blank\">the Amazing<\/a> exude low-key grace and humility—even when they're dropping nine-minute singles. Accordingly, \"Picture You\"—from the band’s upcoming third album—feels less like a grandiose statement than a generous two-songs-for-the-price-of-one deal, blurring dewy early-'70s soft-rock into Floydian prog pastorale (as to be expected from a band that features the guitarist from <a href=\"http:\/\/pitchfork.com\/artists\/1225-dungen\/\" target=\"_blank\">Dungen<\/a> and counts <a href=\"http:\/\/pitchfork.com\/artists\/28673-tame-impala\/\" target=\"_blank\">Tame Impala<\/a> as pals).<!--pagebreak--><\/p> <p>The first half sees a crestfallen Christoffer Gunrup's eyes slowly well up through a cycle of increasingly impassioned verses, but it stops short of delivering the expected cathartic chorus. Instead, the instrumental second act unleashes all that pent-up emotion in a steady drizzle of guitarist Reine Fiske’s glistening, gorgeous leads, which provide a reassuring calm even as the circular rhythm stewing underneath turns more taut and tense. While shaking off some of the folky rusticity that defined their first two albums, \"Picture You\" shows the Amazing retaining their intimate allure even as their sound gets blown up to big-screen proportions—and grants this modest band the opportunity to embrace their haughty name as truth in advertising.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F174052995&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Fri, 07 Nov 2014 12:15:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17200-the-amazing-picture-you\/"},{"title":"Father John Misty: \"Bored in the USA\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17207-father-john-misty-bored-in-the-usa\/","description":"\n<p>A central irony of Josh Tillman's very likable <a href=\"http:\/\/pitchfork.com\/artists\/30204-father-john-misty\/\" target=\"_blank\">Father John Misty<\/a> alias is that he's so often the exact person most indie rock fans totally fucking loathe in real life—a kind of mystic himbo who somehow exists outside our economy and labor force, drinking, drugging, and fucking his way through life, and yet the rent's always paid. People tell him he looks <i>better<\/i> with age. No consequences of note are suffered. Least of all, he attracts not even a fraction of the shit <a href=\"http:\/\/pitchfork.com\/artists\/29855-lana-del-rey\/\" target=\"_blank\">Lana Del Rey<\/a> gets for embodying a parallel sort of archetype. Some might call that male privilege and Tillman probably would, too. \"Bored In The USA\" casually drops a nuclear bomb on the entire franchise of privileged white men making their spiritual void the dark center of the universe.<!--pagebreak--><\/p> <p>Appropriately, the music teases at toxic levels of mawkishness. Tillman's alone at his piano, doing his best <a href=\"http:\/\/pitchfork.com\/artists\/3092-harry-nilsson\/\" target=\"_blank\">Harry Nilsson<\/a> and having the nerve to ask, \"How many people rise and think, 'Oh good, the stranger's body is still here\/ Our arrangement hasn't changed,'\" when most folks stay up nights worrying about dying alone. Likewise, the title itself is sung in a way that doesn't seem to mock <a href=\"http:\/\/pitchfork.com\/artists\/4053-bruce-springsteen\/\" target=\"_blank\">Bruce Springsteen<\/a>—it sounds like Tillman's mocking those who <i>would<\/i> go after that low-hanging fruit, ignoring the Boss' complexities to show their shallow disaffectedness with the American Dream. Or maybe Tillman's just one of us, <a href=\"http:\/\/www.youtube.com\/watch?v=C2QrWzsfghA\" target=\"_blank\" rel=\"nofollow\">not even sure if we're being sarcastic anymore<\/a>. <\/p> <p>\"Bored In the USA\" has a tragicomic resonance, as all of our friends are on Facebook complaining about election results they find awfully scary even if they're unsure how they'll realistically be affected. When Tillman lays out the woes of the upwardly mobile man who had the ladder cut out from under him—\"They gave me a useless education\/ A subprime loan\/ A craftsman home\/ Keep my prescriptions filled\/ Now I can't get off, but I can kinda deal\"—he pipes in a goddamn laugh track to underscore that his concerns aren't clever. They're <i>clichés<\/i> worthy of a terrible sitcom, and that \"boredom\" is like most chronic conditions, a malady of the affluent. So there you have the devastating punchline in \"Bored In the USA\"'s epic #whitepeopleproblems gag—that joke isn't funny anymore.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F174787695&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Thu, 06 Nov 2014 16:30:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17207-father-john-misty-bored-in-the-usa\/"},{"title":"Terrible Truths: \"False Hope\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17206-terrible-truths-false-hope\/","description":"\n<p>Off a <a href=\"http:\/\/bedroomsuckrecords.com\/shop\/bsr-050-va-5-years-of-bedroom-suck\/\" target=\"_blank\" rel=\"nofollow\">compilation<\/a> celebrating the fifth birthday of indie label <a href=\"http:\/\/bedroomsuckrecords.com\" target=\"_blank\" rel=\"nofollow\">Bedroom Suck<\/a>, \"False Hope\" offers a glimpse at the upcoming debut LP from Melbourne trio <a href=\"http:\/\/terribletruths.bandcamp.com\/\" target=\"_blank\" rel=\"nofollow\">Terrible Truths<\/a>. They're a suspenseful band to love; tracks have been drip-fed with each crawling year, and their sporadic shows are prized. And that suspense is mirrored in their music. Tightly-coiled rhythms and vocal jabs flay by inches, giving \"False Hope\" a boiling tension with never quite spills over. Stacey Wilson's bass and Joe Alexander's drumming lock together in a quick-step groove, while Rani Rose fires off wailing bursts of guitar. Bound-up with post-punk alienation, \"False Hope\" is sickened and bold—but, most importantly, cathartic.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F168143484&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Thu, 06 Nov 2014 12:50:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17206-terrible-truths-false-hope\/"},{"title":"Jessica Pratt: \"Back, Baby\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17205-jessica-pratt-back-baby\/","description":"\n<p>It was 2007 when <a href=\"http:\/\/pitchfork.com\/artists\/30852-jessica-pratt\/\">Jessica Pratt<\/a> recorded a bunch of songs that would eventually appear on her <a href=\"http:\/\/pitchfork.com\/reviews\/albums\/17415-jessica-pratt\/\">self-titled 2012 album<\/a>. At the time, she didn't have plans to actually <i>release<\/i> an album—that wouldn't happen until <a href=\"http:\/\/pitchfork.com\/artists\/28957-white-fence\/\" target=\"_blank\">White Fence<\/a>'s Tim Presley somehow heard her record and was so moved that he started a label with the sole purpose of sharing it with the world. It seems logical that Pratt would have that effect on a person. She fingerpicks these gorgeous melodies on her guitar, and in an otherworldly voice, tells elemental, seemingly allegorical stories. \"She has followed you from where dark water and fortune run,\" she sang on \"Mother Big River\".<!--pagebreak--><\/p> <p>On the first single from <a href=\"http:\/\/pitchfork.com\/news\/57166-jessica-pratt-announces-on-your-own-love-again\/\"><i>On Your Own Love Again<\/i><\/a>, her <a href=\"http:\/\/www.dragcity.com\/\" target=\"_blank\" rel=\"nofollow\">Drag City<\/a> debut, Pratt opens with another simple line, one with instantly familiar emotional heft: \"Sometimes, I pray for the rain.\" It's the sort of thing that's likely been scrawled in teenagers' journals countless times, but there's a gentle, earnest quality to her voice that's perfectly suited to phrases like that one. With the nylon strings of her guitar ringing quietly in the background, it'd be easy for her to repeatedly invoke the elements for more loose imagery that's fraught with heartache. Instead, her story is incredibly specific: an undefined relationship that left her feeling hollow. \"Your love was just a myth I devised,\" she admits, and even if there was something there to begin with, she can't go back. \"And sometimes, I pray for the rain,\" she repeats.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F175335041&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Thu, 06 Nov 2014 00:00:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17205-jessica-pratt-back-baby\/"},{"title":"Mykki Blanco: \"A Moment With Kathleen\" [ft. Kathleen Hanna]","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17193-mykki-blanco-a-moment-with-kathleen-ft-kathleen-hanna\/","description":"\n<p>Identity is a learned performance—there's no shortage of ideological through-lines tying <a href=\"http:\/\/pitchfork.com\/artists\/6422-kathleen-hanna\/\" target=\"_blank\">Kathleen Hanna<\/a>'s vision of punk-feminism to that of modern rebel-girl rapper <a href=\"http:\/\/pitchfork.com\/artists\/30309-mykki-blanco\/\" target=\"_blank\">Mykki Blanco<\/a>, but this is a huge one. It's hard to imagine how this meeting of minds on <a href=\"http:\/\/mykkiblanco.bandcamp.com\/track\/a-moment-with-kathleen-feat-kathleen-hanna\" target=\"_blank\" rel=\"nofollow\">\"A Moment With Kathleen\"<\/a>, off Mykki's new <a href=\"http:\/\/pitchfork.com\/news\/57225-mykki-blanco-releases-gay-dog-food-mixtape\/\" target=\"_blank\"><i>Gay Dog Food<\/i><\/a> mixtape, could be more honest: \"Oh my god Gabby, last night I met Kathleen Hanna. She was so cool! She was so sweet,\" Mykki goes, introducing the song, tearfully enthralled in a valley-girl tone that is maybe learned from Hanna herself. Like a <a href=\"http:\/\/pitchfork.com\/artists\/349-bikini-kill\/\" target=\"_blank\">Bikini Kill<\/a> song, it quickly pivots: Mykki cranks \"Moment\" open with some of the hardest, most menacing beats on <i>Gay Dog Food<\/i>, which is saying something for a tape that also includes a song called <a href=\"http:\/\/pitchfork.com\/news\/57070-mykki-blanco-announces-gay-dog-food-shares-moshin-in-the-front-featuring-cities-aviv\/\" target=\"_blank\">\"Moshin in the Front\"<\/a>. The production wouldn't feel out of place on a <a href=\"http:\/\/pitchfork.com\/artists\/29614-death-grips\/\" target=\"_blank\">Death Grips<\/a> album.<!--pagebreak--><\/p> <p>\"A Moment With Kathleen\" is a conceptual blast: Hanna spits about the time she's now clocking in the libraries of punk-scholarship, self-harmonizing manic raps about \"the archive of the archive of the archive\" over sing-song lines about \"runny mascara\" until the past and present are a surreal blur. Remember, <a href=\"https:\/\/www.youtube.com\/watch?v=RTOKRp5FCYY\" target=\"_blank\" rel=\"nofollow\">Hanna's rapped before<\/a>; thankfully, her return includes a very audible line about throwing a boyfriend's clothes out the window and \"<i>burning <\/i>them!\" In joking about the past, Hanna sounds hyper-present, revealing the truth of her archivist stance: \"It's the past when it gets compressed,\" she sings, \"And all that's left is this idea of good winning over evil\/ Or good winning over bad\/ And it's supposed to seem sweeter\/ But really you're just living in trash.\" Which is to say, there is still a lot of work to be done—far outside the archive—and Mykki Blanco is among a school of artists who are doing it.<\/p> <p><iframe src=\"http:\/\/bandcamp.com\/EmbeddedPlayer\/album=2330217042\/size=small\/bgcol=ffffff\/linkcol=0687f5\/track=4136149477\/transparent=true\/\" width=\"320\" height=\"240\" style=\"border: 0; width: 100%; height: 42px;\"><\/iframe><\/p>\n","pubDate":"Wed, 05 Nov 2014 14:40:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17193-mykki-blanco-a-moment-with-kathleen-ft-kathleen-hanna\/"},{"title":"Ariel Pink: \"Picture Me Gone\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17203-ariel-pink-picture-me-gone\/","description":"\n<p>It's yet to be determined how Ariel Pink's new album <a href=\"http:\/\/pitchfork.com\/artists\/3447-ariel-pink\/\" target=\"_blank\"><i>pom pom<\/i><\/a> will be received, but there appears to be a <a href=\"http:\/\/pitchfork.com\/thepitch\/533-who-said-it-ariel-pink-and-glenn-beck-face-off-out-of-context\/\" target=\"_blank\">general<\/a> <a href=\"http:\/\/www.stereogum.com\/1704030\/trolly-ariel-pink-defends-misogynistic-comments-loves-the-westboro-baptist-church\/news\/\" target=\"_blank\" rel=\"nofollow\">consensus<\/a> on how the divisive rollout has gone over. <a href=\"http:\/\/pitchfork.com\/news\/57072-grimes-did-not-like-ariel-pinks-comments-about-madonna\/\" target=\"_blank\">Opinions<\/a> on Madonna's late catalog aside, the clown prince of trash pop managed to pull his foot out of his mouth long enough to do something <a href=\"http:\/\/pitchfork.com\/news\/57114-ariel-pink-performs-jell-o-and-picture-me-gone-with-ps-22-chorus-of-fifth-graders\/\" target=\"_blank\">uncharacteristically sweet last month<\/a> (even if few noticed). Bringing a pair of new songs to the boys and girls of everyone's favorite elementary school chorus, <a href=\"http:\/\/en.wikipedia.org\/wiki\/PS22_Chorus\" target=\"_blank\" rel=\"nofollow\">Staten Island's PS22<\/a>, Pink got to play his strangest role yet: Lead Choirboy.<!--pagebreak--><\/p> <p>The joke-y <a href=\"https:\/\/www.youtube.com\/watch?v=DKEBl-9tO_g#t=22\" target=\"_blank\" rel=\"nofollow\">\"Jell-O\"<\/a> was sure to be a hit with the kids, but it was \"Picture Me Gone\"—a father's lament over the devaluation of physical family keepsakes in the digital era—that made the most impact. It's no wonder, really. \"Picture Me Gone\" is one of the most sentimental things Pink has ever done, a torch song steeped in defeat, the sound of the last man on earth without an iPhone finally caving and picking up a 6 at the mall's loneliest AT&amp;T pagoda. In a year where pop's opinion of technological encroachment at times erred on the side of <a href=\"http:\/\/pitchfork.com\/reviews\/tracks\/16470-st-vincent-digital-witness\/\" target=\"_blank\">condescension<\/a>, \"Picture Me Gone\" is instead a heart-crushing concession. For those worrying that Pink has gone soft, fret not: <a href=\"http:\/\/pitchfork.com\/news\/57315-ariel-pink-shares-creepy-picture-me-gone-video\/\" target=\"_blank\">the video<\/a> for \"Picture Me Gone\" features <a href=\"http:\/\/www.criterion.com\/films\/950-eyes-without-a-face\" target=\"_blank\" rel=\"nofollow\"><i>Eyes Without a Face<\/i><\/a>-masked characters \"in pursuit of sexual encounters and inner content.\" Some things never change.<\/p> <p><iframe src=\"\/\/www.youtube.com\/embed\/YS87mPfD_yI?rel=0\" width=\"620\" height=\"345\" frameborder=\"0\"><\/iframe><\/p>\n","pubDate":"Wed, 05 Nov 2014 13:00:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17203-ariel-pink-picture-me-gone\/"},{"title":"Deers: \"Between Cans\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17204-deers-between-cans\/","description":"\n<p>Lovelorn refrains are often solo declarations, but as <a href=\"http:\/\/deers.bandcamp.com\" target=\"_blank\" rel=\"nofollow\">Deers<\/a>' Ana Garcia Perrote and Carlotta Cosials prove, there's a cathartic joy in commiserating with friends. On the Madrid band’s latest track, \"Between Cans\"—from their new single, <a href=\"http:\/\/deers.bandcamp.com\/album\/barn\" target=\"_blank\" rel=\"nofollow\">\"BARN\"<\/a>—Perrote and Cosials intertwine their vocals as if they’re trading woeful stories, both concluding with a pouting chorus: \"Baby, baby, baby, baby, what are you doing to me?\" In the year since the band formed, Deers have doubled into in a four-piece, which has helped fill out their earlier barebones sound. This works well particularly on \"Between Cans\", with an assertive rhythm and off-kilter guitar line that add character to the lo-fi dissonance. Deers are still finding their way into a sound of their own, but the chaotic journey along the way makes for an enjoyable ride.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F173943307&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Wed, 05 Nov 2014 12:30:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17204-deers-between-cans\/"},{"title":"Natalie Prass: \"Why Don’t You Believe in Me\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17202-natalie-prass-why-dont-you-believe-in-me\/","description":"\n<p>A Nashville singer-songwriter who sounds nothing like a Nashville singer-songwriter, <a href=\"http:\/\/natalieprassmusic.com\" target=\"_blank\" rel=\"nofollow\">Natalie Prass<\/a> has spent much of 2014 singing back-up in <a href=\"http:\/\/pitchfork.com\/artists\/6113-jenny-lewis\/\" target=\"_blank\">Jenny Lewis<\/a>' band, but she’ll be her own boss in 2015. Due in January, her debut was recorded at <a href=\"http:\/\/spacebombrecords.com\/info\/studio\" target=\"_blank\" rel=\"nofollow\">Spacebomb Studio<\/a> in Richmond, Virginia, with Trey Pollard writing string arrangements and Prass' high school friend <a href=\"http:\/\/pitchfork.com\/artists\/30501-matthew-e-white\/\" target=\"_blank\">Matthew E. White<\/a> contributing horn charts. On \"Why Don’t You Believe in Me\", from the album, the warm, lush sound morphs from one measure to the next, from the swamp-soul verses to the gently funky chorus. The song is steeped in the florid r&amp;b of the '60s and early 1970s, around the heyday of FAME and <a href=\"http:\/\/pitchfork.com\/reviews\/albums\/9986-stax-50th-anniversary-celebration\/\" target=\"_blank\">Stax<\/a>, but never beholden to mere revivalism.<!--pagebreak--><\/p> <p>\"Why Don’t You Believe in Me\" is all slow-motion strut, with a solid rhythm section anchoring the piano flourishes and flashes of brass, everything coalescing to highlight Prass' soulful phrasing. With the luxuriance of <a href=\"http:\/\/pitchfork.com\/artists\/5038-dusty-springfield\/\" target=\"_blank\">Dusty Springfield<\/a> and the reedy expressiveness of Diana Ross, her voice sounds full in its lower register and fluttery when she careens toward the higher notes. Prass is one of those rare singer-songwriters who is most confident and compelling when she's examining her greatest uncertainties and fears. \"Why Don’t You Believe in Me\" pleads with a lover not to leave, but it never stoops to beg. Instead, Prass presents her case as logically as possible, as though she is still working through things in her head. \"Wanna call you but I don’t, I want to be smarter,\" she sings. \"Afraid to make my next move.\" She may be romantically paralyzed, but the music won’t let her lapse into self-pity or self-absorption. Instead, she musters the guts to promise, \"You’ll wish I was with you.\"<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F172419999&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Tue, 04 Nov 2014 16:30:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17202-natalie-prass-why-dont-you-believe-in-me\/"},{"title":"Cloakroom: \"Dream Warden\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17197-cloakroom-dream-warden\/","description":"\n<p><a href=\"http:\/\/www.h-u-m.net\/index.php\" target=\"_blank\" rel=\"nofollow\">Hum<\/a>'s imprint on pop culture is limited to <a href=\"https:\/\/www.youtube.com\/watch?v=Rfbn3ieVUYU\" target=\"_blank\" rel=\"nofollow\">\"Stars\"<\/a>, a minor alt-rock hit from 1995. They were marketed as post-<a href=\"http:\/\/pitchfork.com\/artists\/3838-the-smashing-pumpkins\/\" target=\"_blank\">Pumpkins<\/a>, but in light <a href=\"https:\/\/www.youtube.com\/watch?v=eBG7P-K-r1Y\" target=\"_blank\" rel=\"nofollow\">Foo Fighters' \"Everlong\"<\/a>, <a href=\"https:\/\/www.youtube.com\/watch?v=LPW92FVMnFI\" target=\"_blank\" rel=\"nofollow\">Deftones' \"Be Quiet and Drive (Far Away)\"<\/a> and 90% of Jimmy Eat World's pre-<a href=\"https:\/\/www.youtube.com\/watch?v=Nl3vGClF_hA\" target=\"_blank\" rel=\"nofollow\"><i>Bleed American<\/i><\/a> material, Hum's combination of vertiginous alt-gaze and gooey lyricism was years ahead of its time. They've become an increasingly common influence for contemporary bands—on <a href=\"http:\/\/pitchfork.com\/artists\/31634-nothing\/\" target=\"_blank\">Nothing<\/a>, <a href=\"http:\/\/pitchfork.com\/artists\/30251-whirr\/\" target=\"_blank\">Whirr<\/a>, and <a href=\"http:\/\/pitchfork.com\/artists\/31620-title-fight\/\" target=\"_blank\">Title Fight<\/a>, to name a few. When Hum is namedropped, a band is telling you they want to sound like post-hardcore, emo, shoegaze, indie rock, metal and math-rock at the same time.<!--pagebreak--><\/p> <p>Almost no one gets it right. It's questionable whether Hum ever did either. But the industrious Indiana trio <a href=\"http:\/\/www.runforcoverrecords.com\/cloakroom.php\" target=\"_blank\" rel=\"nofollow\">Cloakroom<\/a> put forth a solid effort on last year's sludgy, narcotic <a href=\"http:\/\/runforcoverrecords.bandcamp.com\/album\/infinity\" target=\"_blank\" rel=\"nofollow\"><i>Infinity<\/i><\/a> and aren't taking any half-measures this time around. They've actually got Hum's own Matt Talbott contributing guest vocals on \"Dream Warden\", the B-side for a tour-only 7\"; Talbott also produced their upcoming record <i>Further Out<\/i>, and Cloakroom's insistence on a purely analog recording, mixing, mastering and vinyl process has delayed its release to January.<\/p> <p>As the story goes, Talbott laid down his own vocals with Cloakroom's blessing after they ran out of time in the studio, and the result contorts their curious self-description of \"stoner emo\". \"Dream Warden\" implies both warm reverie and cold reality, a simultaneous desire to become whole and disintegrate. Or, it's just a heavy-lidded pop song seeking to make good on the mission statement of Hum's final album—<a href=\"http:\/\/www.discogs.com\/Hum-Downward-Is-Heavenward\/master\/46996\" target=\"_blank\" rel=\"nofollow\">downward is heavenward<\/a>.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F173363074&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Tue, 04 Nov 2014 15:30:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17197-cloakroom-dream-warden\/"},{"title":"Romare: \"Roots\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17199-romare-roots\/","description":"\n<p>Is that a croaking frog, or an automated belch? The beginning of <a href=\"http:\/\/pitchfork.com\/artists\/31100-romare\/\" target=\"_blank\">Romare<\/a>'s new song, \"Roots\", ascends from a swampy abyss and slowly unfolds above the marsh. Just as the fog lifts on Romare’s blurry space-funk, a random voice jumps in to bring you back to civilization: This is a dance song, after all. Still, \"Roots\" registers a little deeper. It’s in the depth of the drums, one stacked on the other for a rich, layered sound. It’s in the vocals—the aforementioned yelp played well against a decipherable, human-like grunt.<!--pagebreak--><\/p> <p>For almost eight minutes, the UK producer offers the first taste of his forthcoming <i>Roots<\/i> EP (out December 1) and full-length <i>Projections<\/i> LP (out in February). The song isn’t completely dark; on its second half, Romare uses brighter synthetics to illuminate the shade, guiding you through a seamless path leading to sunny utopia. By track's end, you’re in a completely different place—the new surroundings are picturesque, but the muck was pretty nice, too.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F174060783&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Mon, 03 Nov 2014 14:05:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17199-romare-roots\/"},{"title":"Cottaging: \"Arco Iris\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17198-cottaging-arco-iris\/","description":"\n<p>Tommy Conte played drums in the great Tampa hardcore band <a href=\"http:\/\/www.discogs.com\/artist\/1240386-Cult-Ritual\" target=\"_blank\" rel=\"nofollow\">Cult Ritual<\/a>, and he currently does the same in <a href=\"http:\/\/pitchfork.com\/artists\/31728-the-ukiah-drag\/\" target=\"_blank\">the Ukiah Drag<\/a>. But for his side project, <a href=\"https:\/\/soundcloud.com\/cottaging\" target=\"_blank\" rel=\"nofollow\">Cottaging<\/a>, he’s moved to the front of the stage—and the results are just as beautifully disastrous. Based alongside the Ukiah Drag in Providence, Cottaging doesn’t sound too far off from their sister group’s sandblasted post-punk and shuddering garage-goth (Ukiah's Brian Hennessey also plays in Cottaging). On \"Arco Iris\"—a highlight from their new EP <a href=\"http:\/\/wharfcatrecords.com\/store\/pre-order-cottaging-amyl-banshee-ep\" target=\"_blank\" rel=\"nofollow\"><i>The Amyl Banshee<\/i><\/a>, which follows last year’s neck-snapping <a href=\"http:\/\/thehungrycottager.tumblr.com\/post\/45433940743\/download-our-latest-effort-nightshading-4-tracks\" target=\"_blank\" rel=\"nofollow\"><i>Nightshading<\/i><\/a> cassette—Conte and company claw their way through death-rock murk with demented screeches and riffs like filthy knives. But there’s a controlled, chrome-plated cruelty to it that makes you think they just might be sane underneath all the chaos. Which is even scarier.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F167594086&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Mon, 03 Nov 2014 13:40:00 -0500","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17198-cottaging-arco-iris\/"},{"title":"Ipps: \"U Need 2 Bleed\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17191-ipps-u-need-2-bleed\/","description":"\n<p>Scenes come and go in waves. In central Ohio, the heyday of <a href=\"http:\/\/columbusdiscountrecords.com\" target=\"_blank\" rel=\"nofollow\">Columbus Discount Records<\/a>, which served as an incubator for bands like <a href=\"http:\/\/pitchfork.com\/artists\/5176-times-new-viking\/\" target=\"_blank\">Times New Viking<\/a> and <a href=\"http:\/\/pitchfork.com\/artists\/7067-psychedelic-horseshit\/\" target=\"_blank\">Psychedelic Horseshit<\/a>, has passed. CDR co-founder Adam Smith, the onetime heir apparent of <a href=\"http:\/\/pitchfork.com\/features\/articles\/9067-musicol\/\" target=\"_blank\">Musicol Recording Studio<\/a>, is now manning a lathe outside of Austin. Assuming CDR’s mantle is <a href=\"http:\/\/superdreamerrecords.com\" target=\"_blank\" rel=\"nofollow\">Superdreamer Records<\/a>, which just released <a href=\"https:\/\/ipps.bandcamp.com\/album\/everything-is-real\" target=\"_blank\" rel=\"nofollow\"><i>Everything is Real<\/i><\/a> by the band <a href=\"https:\/\/www.facebook.com\/ippstheband\" target=\"_blank\" rel=\"nofollow\">Ipps<\/a>. Led by the husband\/wife pair of Bo and Emily Davis (formerly of Necropolis), Ipps is the sound of four Columbus vets simultaneously not caring and having a blast, which often go hand in hand. Where Necropolis layered asymmetrical noise with abstract lyrics, Ipps writes bouncy, fuzzy pop songs—like if their buddies in <a href=\"http:\/\/pitchfork.com\/artists\/31291-connections\/\" target=\"_blank\">Connections<\/a> grew up listening to <a href=\"http:\/\/pitchfork.com\/artists\/2700-mates-of-state\/\" target=\"_blank\">Mates of State<\/a> through a megaphone they didn’t know was broken.<!--pagebreak--><\/p> <p>\"If it doesn’t come clean with bleach\/ You need a leach\/ You need to bleed,\" the Davises harmonize on \"U Need 2 Bleed\", offering various arguments for why bloodletting is a good idea. Yet even with lines like \"Open up and let it flow and watch the poison drain from your veins,\" the song sounds innocent enough that you can imagine the couple singing it in the living room for their young son, accidentally incubating a future generation’s scene.<\/p> <p><iframe src=\"https:\/\/bandcamp.com\/EmbeddedPlayer\/album=3051261881\/size=small\/bgcol=ffffff\/linkcol=0687f5\/track=1561285497\/transparent=true\/\" width=\"320\" height=\"240\" style=\"border: 0; width: 100%; height: 42px;\"><\/iframe><\/p>\n","pubDate":"Thu, 30 Oct 2014 16:20:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17191-ipps-u-need-2-bleed\/"},{"title":"GABI: \"Koo Koo\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17196-gabi-koo-koo\/","description":"\n<p>If you detect a touch of the contemporary composition scene in <a href=\"https:\/\/www.facebook.com\/pages\/GABI\/507977972575254?notif_t=page_new_likes\" target=\"_blank\" rel=\"nofollow\">GABI<\/a>'s <a href=\"http:\/\/www.softwarelabel.net\/shop\/gabi-koo-koo\/\" target=\"_blank\" rel=\"nofollow\">\"Koo Koo\"<\/a>, that's probably not an accident. GABI, a.k.a. Gabrielle Herbst, studied at Bard College under experimental heavywights like <a href=\"http:\/\/www.zeenaparkins.com\" target=\"_blank\" rel=\"nofollow\">Zeena Parkins<\/a> and <a href=\"http:\/\/www.marinarosenfeld.com\" target=\"_blank\" rel=\"nofollow\">Marina Rosenfeld<\/a>; earlier this year, she premiered her first opera, <a href=\"http:\/\/roulette.org\/events\/gabrielle-herbst-bodiless\/\" target=\"_blank\" rel=\"nofollow\"><i>Bodiless<\/i><\/a>, at <a href=\"http:\/\/roulette.org\/events\/gabrielle-herbst-bodiless\/\" target=\"_blank\" rel=\"nofollow\">Roulette<\/a>, a New York new-music institution, and in 2011 she was an artist-in-residence at Robert Wilson's <a href=\"http:\/\/watermillcenter.org\" target=\"_blank\" rel=\"nofollow\">Watermill Center<\/a>.<!--pagebreak--><\/p> <p>For all its fine art credentials, though, \"Koo Koo\" is not \"difficult\" music. Herbst opens the song with a simple statement, \"I wait for you,\" which she sings in a voice so clear and so pure that it could take your breath away. From there, her voice breaks into a multi-tracked array of contrapuntal figures. Fleshed out with a subtle touch of strings and marimba, they rise and fall, rise and fall, half wordless and half grounded in the language of desire. \"I want you,\" she coos, while all around her a breathy pulse pumps steadily on; it's like a kaleidoscopic glimpse of the heart's innermost chambers.<\/p> <p><iframe src=\"\/\/www.youtube.com\/embed\/0pf1Ca4HjZk?rel=0\" width=\"620\" height=\"345\" frameborder=\"0\"><\/iframe><\/p>\n","pubDate":"Thu, 30 Oct 2014 15:30:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17196-gabi-koo-koo\/"},{"title":"AJ Davila y Terror Amor: \"Borderline\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17195-aj-davila-y-amor-terror-borderline\/","description":"\n<p>Love is patient and kind, but it can also be the cause of a terrible plague. At least when sung by <a href=\"https:\/\/twitter.com\/ajdavilasix\" target=\"_blank\" rel=\"nofollow\">AJ Davila<\/a>, the mastermind behind San Juan, Puerto Rico’s shit-kicking punk troupe <a href=\"http:\/\/pitchfork.com\/artists\/29564-davila-666\/\" target=\"_blank\">Davila 666<\/a>. While 666 is on a break, Davila has been creating head-smashing tunes with his seven-piece band of miscreants, <a href=\"https:\/\/www.facebook.com\/ajdavilasix\" target=\"_blank\" rel=\"nofollow\">Terror Amor<\/a>, who are making movements of their own in the city’s well-established garage punk scene. The project is an amalgamation of sunburned pop, <i>Nuggets<\/i>-era psych and a generous dose of curb-stomping punk, and apparently a sight to behold live—grilling competitions, polka dances and unicorns make their way onto a Terror Amor stage, helmed by Davila and <a href=\"http:\/\/music.remezcla.com\/2013\/latin\/interview-aj-davila-soundtrack-of-your-life-and-my-life-together\/\" target=\"_blank\" rel=\"nofollow\">his wish<\/a> that audiences dance, dance, dance.<!--pagebreak--><\/p> <p>Fittingly, the first single from the band’s upcoming <a href=\"http:\/\/burgerrecords.11spot.com\/aj-davila-y-terror-amor-beibi-pre-order.html\" target=\"_blank\" rel=\"nofollow\">Burger Records<\/a> album <a href=\"http:\/\/burgerrecords.11spot.com\/aj-davila-y-terror-amor-beibi-pre-order.html\" target=\"_blank\" rel=\"nofollow\"><i>Beibi<\/i><\/a>, the rollicking \"Borderline\", is an infectious incantation invoking the spirits of revenge with \"bones, smoke and silk.\" Amidst yelps, whoops and a stomping guitar line at the core, Davila squeals a redemptive tale in Spanish, of which the chorus roughly translates to: \"If there's love left, I don't know what it is\/ I just want to want to think about what I will achieve.\" Davila gets the last laugh in the punchy psychedelic number as he pursues life beyond his ex-lover, into a sunnier future of joy, self-actualization and, of course, dance parties.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F168979102&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Thu, 30 Oct 2014 13:20:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17195-aj-davila-y-amor-terror-borderline\/"},{"title":"Shamir: \"On the Regular\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17194-shamir-on-the-regular\/","description":"\n<p>Origin story, in two lines: \"Ever since I was eight, I was attached to the mic\/ Wanted a guitar before I wanted a bike.\" Young <a href=\"http:\/\/pitchfork.com\/artists\/32133-shamir\/\" target=\"_blank\">Shamir Bailey<\/a> explains it all in <a href=\"http:\/\/pitchfork.com\/news\/57242-shamir-shares-on-the-regular-video-signs-to-xl\/\" target=\"_blank\">\"On the Regular\"<\/a>, his first song since releasing the <a href=\"http:\/\/pitchfork.com\/reviews\/albums\/19425-shamir-northtown-ep\/\" target=\"_blank\"><i>Northtown<\/i> debut EP<\/a> earlier this year and signing with <a href=\"http:\/\/www.xlrecordings.com\/\" target=\"_blank\" rel=\"nofollow\">XL<\/a> shortly thereafter. Over cowbell and rude synths, Shamir brags about his style and lusts for butts while beaming adorkably in the accompanying video, where each boast and jibe comes with its own color or childhood toy.<!--pagebreak--><\/p> <p>The hypnotic rhythm is briefly interrupted at the bridge, as he switches from smart-aleck spaz to angelic soul in order to wail at his haters. In the video, Shamir morphs into the soft-focus Starchild and stoically poses with a baseball bat while a disco ball spins to the side, lest you think he’s being self-serious. It’s enough to make you shed a single, appreciative tear. Then, the rhythm snaps back as the infectious vibe completes its takeover, making the point: This is Shamir, and now we know.<\/p> <p><iframe src=\"\/\/www.youtube.com\/embed\/Lp9GgdCgMXk?rel=0\" width=\"620\" height=\"345\" frameborder=\"0\"><\/iframe><\/p>\n","pubDate":"Thu, 30 Oct 2014 10:40:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17194-shamir-on-the-regular\/"},{"title":"Ghostface Killah \/ BADBADNOTGOOD: \"Gunshowers\" [ft. Elzhi]","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17192-ghostface-killah-badbadnotgood-gunshowers-ft-elzhi\/","description":"\n<p>During the <a href=\"http:\/\/pitchfork.com\/artists\/4628-wu-tang-clan\/\" target=\"_blank\">Wu-Tang Clan<\/a>’s glory days of the mid-1990s, in-house producers the <a href=\"http:\/\/pitchfork.com\/artists\/3623-rza\/\" target=\"_blank\">RZA<\/a>, 4th Disciple and True Master fused sharp drums, obscure vocal clips and murky strings, its shadowy blend a perfect backdrop for the group’s streetwise narratives. Despite the productive approach, clansman <a href=\"http:\/\/pitchfork.com\/artists\/1824-ghostface-killah\/\" target=\"_blank\">Ghostface Killah<\/a> never needed all that—just flip some old <a href=\"http:\/\/www.youtube.com\/watch?v=SO35_WbNAeM\" target=\"_blank\" rel=\"nofollow\">Al Green<\/a> or <a href=\"http:\/\/www.youtube.com\/watch?v=JS0XhXsmCRs\" target=\"_blank\" rel=\"nofollow\">Eddie Holman<\/a> and let him go. In most cases, the beat was a mere addendum to Ghost’s lyrical agility. Hell, he’d flow <a href=\"https:\/\/www.youtube.com\/watch?v=WvYv6bWHF9M\" target=\"_blank\" rel=\"nofollow\">even after the music cut off<\/a>.<!--pagebreak--><\/p> <p>Perhaps on purpose, <a href=\"http:\/\/pitchfork.com\/news\/57121-badbadnotgood-announces-sour-soul-new-album-featuring-ghostface-killah-on-every-track\/\" target=\"_blank\">BADBADNOTGOOD<\/a> keep things simple on \"Gunshowers\", their new single from <i>Sour Soul<\/i>, a collaborative album with Ghostface. Above a straightforward guitar loop, he and guest rapper <a href=\"http:\/\/pitchfork.com\/artists\/17969-elzhi\/\" target=\"_blank\">Elhzi<\/a> suffocate it with endless bars. The stark simplicity and Spaghetti Western aesthetic resemble an old Wu track or Quentin Tarantino score. \"Simple minds get blown, shattered into pieces,\" Ghost exclaims in his usual high pitch. \"My thesis is thick like the Book of Eli.\" Later—following a standout verse from Elhzi—Ghost concludes with this brusque takeaway: \"Pull ya tongue through ya neck when the cartel’s done witcha.\" Yeah it's cringe-worthy, but what's a Ghost track without a WTF moment?<\/p> <p><iframe src=\"\/\/www.youtube.com\/embed\/H-qmZ_J7WGc\" width=\"620\" height=\"345\" frameborder=\"0\"><\/iframe><\/p>\n","pubDate":"Wed, 29 Oct 2014 16:30:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17192-ghostface-killah-badbadnotgood-gunshowers-ft-elzhi\/"},{"title":"Nerftoss: \"Bottomless\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17190-nerftoss-bottomless\/","description":"\n<p>John Jones grinds out tight grooves as the bassist for <a href=\"http:\/\/pitchfork.com\/artists\/29803-dope-body\/\" target=\"_blank\">Dope Body<\/a>, but it turns out he likes to stretch out, too. His solo project <a href=\"https:\/\/soundcloud.com\/nerftoss\" target=\"_blank\" rel=\"nofollow\">Nerftoss<\/a> deals in a jammier, more open-ended brand of rock, though its scope is more diverse than that description might imply. His forthcoming LP <a href=\"http:\/\/ehserecords.com\/ehse027\/\" target=\"_blank\" rel=\"nofollow\"><i>Maiden Powers<\/i><\/a> shifts deftly from fully-fleshed pop to weird bedroom experiments to sky-seeking loops, all with a sense of drive and wonder that gives the album unifying character.<!--pagebreak--><\/p> <p>\"Bottomless\" falls pretty firmly under the sky-seeking loop category. If Dope Body sometimes recalls the grunting pound of the <a href=\"http:\/\/pitchfork.com\/artists\/2187-the-jesus-lizard\/\" target=\"_blank\">Jesus Lizard<\/a>, this track veers closer to the kraut-punk meditations of <a href=\"http:\/\/pitchfork.com\/artists\/19280-boredoms\/\" target=\"_blank\">Boredoms<\/a> circa <a href=\"http:\/\/en.wikipedia.org\/wiki\/Super_%C3%A6\" target=\"_blank\" rel=\"nofollow\"><i>Super æ<\/i><\/a>. A hyper drumbeat is the song’s backbone, but Jones’ stair-climbing bass is the fuel, propelling forward into a sunbeam of rising guitars. It would be easy for the \"Bottomless\" to be lazy mush, the musical equivalent of laying in the grass and staring at the clouds, but Jones grounds the tune in punk energy, making it more like a focused meditation than a drifting nap.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F172117190&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Wed, 29 Oct 2014 12:40:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17190-nerftoss-bottomless\/"},{"title":"Katie Gately: \"Pivot\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17189-katie-gately-pivot\/","description":"\n<p>Pop songs, as a rule, do not run to more than 14 minutes long. Perhaps no one told <a href=\"http:\/\/katiegately.com\" target=\"_blank\" rel=\"nofollow\">Katie Gately<\/a>? Because her \"Pivot\" amounts to just that—a sing-songy earworm stretched out, Slinky-like, into a succession of twisting, elongated hooks. Like her first two releases—a cassette for the <a href=\"https:\/\/soundcloud.com\/blue-tapes\/blue-eight-katie-gately-pipes\" target=\"_blank\" rel=\"nofollow\">Blue Tapes<\/a> label and an EP on <a href=\"https:\/\/publicinformation.bandcamp.com\/album\/katie-gately\" target=\"_blank\" rel=\"nofollow\">Public Information<\/a>—Gately's <a href=\"http:\/\/fatcat.sandbaghq.com\/katie-gately-tlaotlon-split-series-23-pre-order.html\" target=\"_blank\" rel=\"nofollow\">side-length contribution<\/a> to the latest in <a href=\"http:\/\/www.fat-cat.co.uk\" target=\"_blank\" rel=\"nofollow\">FatCat<\/a>'s Split Series treats voice as something malleable and elastic. It is a contribution to a line of research that stretches from Meredith Monk through <a href=\"http:\/\/pitchfork.com\/artists\/30806-holly-herndon\/\" target=\"_blank\">Holly Herndon<\/a>.<!--pagebreak--><\/p> <p>By day, Gately works as a sound designer in Hollywood, which might explain why \"Pivot\" seems to leap from the speakers with kinetic fury. It explodes with rushing white noise and zippering buzz and weirdly hued plasma bursts; one imagines the keys on her sampler bear star-shaped labels like \"BLAM,\" \"POWWW\", and \"ZZZZOOM\", in keeping with their cartoon-like nature. Still, there's nothing cartoonish about the song itself. Look past the twisted metal sound effects and the kazoo-like melodies, and you'll find something both meditative and strangely intuitive, like medieval plainsong retrofitted for the airwaves of the future.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F173296559&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Wed, 29 Oct 2014 11:30:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17189-katie-gately-pivot\/"},{"title":"Mourn: \"Silver Gold\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17188-mourns-silver-gold\/","description":"\n<p>We're told time and time again—rock and roll is no longer the sound of youth culture. In a backwards way, Spanish punk band <a href=\"http:\/\/ohmourn.bandcamp.com\" target=\"_blank\" rel=\"nofollow\">Mourn<\/a> prove this; none of their members are older than 18, and if they were a pop or hip-hop group, somehow this would be a talking point of far less interest. As far as guitar music goes, teens are typically either lauded as prodigies or punks, gawked at or given backhanded compliments for powering through a lack of technical skills. \"Silver Gold\", the volcanic closer on Mourn's upcoming <a href=\"http:\/\/capturedtracks.com\" target=\"_blank\" rel=\"nofollow\">Captured Tracks<\/a> debut, is undeniably youthful. They're not hiding their influences; these are musicians still in the discovery phase, channeling <a href=\"http:\/\/pitchfork.com\/artists\/1896-pj-harvey\/\" target=\"_blank\">PJ Harvey<\/a>, <a href=\"http:\/\/pitchfork.com\/artists\/3829-sleater-kinney\/\" target=\"_blank\">Sleater-Kinney<\/a>, <a href=\"http:\/\/pitchfork.com\/artists\/3986-sunny-day-real-estate\/\" target=\"_blank\">Sunny Day Real Estate<\/a> and other 90s titans who are life-altering upon first listening.<!--pagebreak--><\/p> <p>But this isn't <a href=\"http:\/\/pitchfork.com\/thepitch\/348-lukas-moodysson\/\" target=\"_blank\"><i>We Are the Best!<\/i><\/a> on wax. More importantly, the Catalonian quartet play with an unshakable conviction and a lack of self-consciousness, recording straight-to-tape, letting the harmonies bleed together and drums play at maxed-out levels. What Jazz Rodriguez and Carla Perez Vas are singing about is unclear, even in their rudimentary English (\"deliver me from heaven\" is the one lyric that peeks through the murk), but \"Silver Gold\" comes across as a love song about punk rock and having a long life in it ahead of you.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F171534011&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Tue, 28 Oct 2014 14:05:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17188-mourns-silver-gold\/"},{"title":"Drake: \"How Bout Now\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17187-drake-how-bout-now\/","description":"\n<p>Nobody runs a victory lap like <a href=\"http:\/\/pitchfork.com\/artists\/27950-drake\/\" target=\"_blank\">Drake<\/a>. Fresh off turning 28 a night earlier, he nonchalantly dropped three new songs on Saturday in an effort to beat some hackers to the punch. Even if the release was more counter-piracy than coronation, it was a reminder that few other artists—like, you can count them on your hand—can loose a few C-sides onto <a href=\"http:\/\/soundcloud.com\/octobersveryown\" target=\"_blank\" rel=\"nofollow\">SoundCloud<\/a> and momentarily make the world stop. \"How Bout Now\" is the best of the bunch, and it's an inadvertently neat summary of his last few years atop the throne.<!--pagebreak--><\/p> <p>Built on a chipmunked Jodeci sample, it blends the sinew and shadow of <a href=\"http:\/\/pitchfork.com\/reviews\/albums\/18511-drake-nothing-was-the-same\/\" target=\"_blank\"><i>Nothing Was the Same<\/i> <\/a>with the soul and baroque flourishes of <i><a href=\"http:\/\/pitchfork.com\/reviews\/albums\/16039-take-care\/\" target=\"_blank\">Take Care<\/a><\/i>. It’s slinky and amorphous, it’s emotionally unvarnished, it’s rich with Toronto slang and Jamaican patois, and it's petty as hell. (\"I bought your dad a bunch of shit for Christmas\/ He ain’t even say thank you\"; somewhere in America, <a href=\"https:\/\/www.youtube.com\/watch?v=3GnGZWWz00c\" target=\"_blank\" rel=\"nofollow\">Courtney from Hooters on Peachtree<\/a> solemnly nods.) It’s a vindictive statement from someone who doesn’t have much around him in the way of competition right now. And it’s thanks to that internal fire that, a year after <a href=\"http:\/\/pitchfork.com\/news\/53459-listen-drake-trophies\/\" target=\"_blank\">\"Trophies\"<\/a>, Drake is still holding them.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F173837616&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Tue, 28 Oct 2014 13:34:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17187-drake-how-bout-now\/"},{"title":"ScotDrakula: \"O'Clock\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17165-scotdrakula-oclock\/","description":"\n<p>If you hadn't already guessed, here's the backstory behind Melbourne band <a href=\"https:\/\/scotdrakula.bandcamp.com\/\" target=\"_blank\" rel=\"nofollow\">ScotDrakula<\/a>'s name: Guitarist\/vocalist Matt Neumann was describing the show \"Quantum Leap\" to his girlfriend. After he talked about <a href=\"http:\/\/www.imdb.com\/name\/nm0000836\/\" target=\"_blank\" rel=\"nofollow\">the lead actor<\/a> a couple times, she goes, \"So does he drink blood or something?\" Yes, she thought she heard him say \"Scott Dracula\" and, in turn, gave birth to an absurd band name. But don't get too hung up on the goofy moniker: \"O'Clock\" is an elated jam that's right on time to soundtrack the impending Australian summer.<!--pagebreak--><\/p> <p>\"I'm sorry if I'm comin' on a little strong,\" Neumann sings, and you can see how that might be the case. The guy's got this quality about his voice that's explosively coarse. Later, he asserts that he feels so electric he could start a fire. He's got undeniable confidence and magnetism as a frontman, punching out every word he sings with a wild, unpredictable swagger. It's the perfect counterbalance to the track's prominent organ, which lays the mellow groundwork. This is the sound of hijinx on a beautiful day: a sunny, jangling choogle (with handclaps and tambourine) overtaken by a huge guitar solo and unhinged vocals. <\/p> <p><iframe src=\"\/\/www.youtube.com\/embed\/hHEQvV69AQ4\" width=\"620\" height=\"345\" frameborder=\"0\"><\/iframe><\/p>\n","pubDate":"Mon, 27 Oct 2014 17:45:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17165-scotdrakula-oclock\/"},{"title":"Bully: \"Milkman\"","link":"http:\/\/pitchfork.com\/reviews\/tracks\/17186-bully-milkman\/","description":"\n<p>There's something inherently creepy about a profession when both <a href=\"http:\/\/www.youtube.com\/watch?v=MqTKOq8DmWU\" target=\"_blank\" rel=\"nofollow\">Aphex Twin<\/a> and <a href=\"https:\/\/www.youtube.com\/watch?v=6ZrKAR32WKU\" target=\"_blank\" rel=\"nofollow\">EMA<\/a> see fit to pay it tribute. Certainly, the role of the milkman leaves a lot to the imagination—it's as crucial to the current economy as, say, a cobbler or haberdasher. In the mind of <a href=\"https:\/\/soundcloud.com\/bullythemusic\/\" target=\"_blank\" rel=\"nofollow\">Bully<\/a>'s Alicia Bognanno, taking up that trade means having the ability to drop by your porch every now and then just to say hi. A wholesome, useful way of being a part of your life again, and one that could not be less realistic.<!--pagebreak--><\/p> <p>The one thing that stands in the way of what Bognanno wants to be is who she is: at a \"circle in Logan Square\/ Spinning around in my underwear,\" and presumably fresh out of a psych hold. (\"When I checked out 10 months ago\/ I had never felt that way before,\" she sings.) These are the slight sour notes that lend complexity to an otherwise jagged piece of rock candy from Bully's debut EP, where the Nashville four-piece channel the Dambuilders, Pixies and other 90s indie figures that were called \"blandly entertaining college rock\" by <a href=\"http:\/\/pitchfork.com\/artists\/6367-steve-albini\/\" target=\"_blank\">Steve Albini<\/a>, under whom Bognanno <a href=\"http:\/\/www.nashvillescene.com\/nashville\/alicia-bognanno\/Content?oid=4084767\" target=\"_blank\" rel=\"nofollow\">worked as a sound engineer in Chicago<\/a>. Fortunately, Bognanno honed her recording craft during her time at <a href=\"http:\/\/www.electricalaudio.com\" target=\"_blank\" rel=\"nofollow\">Electrical Audio<\/a>, and not her taste.<\/p> <p>\n<iframe width=\"100%\" height=\"400\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?visual=true&url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F170371349&show_artwork=true\"><\/iframe> <\/p>\n","pubDate":"Mon, 27 Oct 2014 17:00:00 -0400","guid":"http:\/\/pitchfork.com\/reviews\/tracks\/17186-bully-milkman\/"}]}}